aaron-bond.better-comments
angular.ng-template
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
codezombiech.gitignore
continue.continue
cweijan.dbclient-jdbc
cweijan.vscode-postgresql-client2
damildrizzy.fastapi-snippets
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.vscode-pull-request-github
gruntfuggly.todo-tree
hediet.vscode-drawio
humao.rest-client
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.vscode-chat-customizations-evaluations
pkief.material-icon-theme
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
tamasfe.even-better-toml
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
yzhang.markdown-all-in-one
