aaron-bond.better-comments
bierner.markdown-mermaid
charliermarsh.ruff
christian-kohler.path-intellisense
codezombiech.gitignore
continue.continue
cweijan.vscode-postgresql-client2
damildrizzy.fastapi-snippets
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-pull-request-github
gruntfuggly.todo-tree
hediet.vscode-drawio
humao.rest-client
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.makefile-tools
ms-vscode-remote.remote-ssh
pkief.material-icon-theme
redhat.vscode-xml
redhat.vscode-yaml
tamasfe.even-better-toml
usernamehw.errorlens
yzhang.markdown-all-in-one
