aaron-bond.better-comments
alexcvzz.vscode-sqlite
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
codezombiech.gitignore
continue.continue
cweijan.dbclient-jdbc
cweijan.vscode-postgresql-client2
damildrizzy.fastapi-snippets
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
donjayamanne.python-environment-manager
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
evendead.help-me-add
formulahendry.auto-rename-tag
github.vscode-pull-request-github
gruntfuggly.todo-tree
hediet.vscode-drawio
humao.rest-client
igorsbitnev.error-gutters
johnpapa.vscode-peacock
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-pt-br
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-mssql.data-workspace-vscode
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
oracle.sql-developer
pkief.material-icon-theme
redhat.java
redhat.vscode-yaml
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-portuguese-brazilian
tamasfe.even-better-toml
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-lombok
vscjava.vscode-maven
yzhang.markdown-all-in-one
